In [1]:
import pandas as pd
from sklearn import preprocessing

In [2]:
data = pd.read_csv('cdc.csv')

In [3]:
data.head()

,genhlth,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender
0,good,0,1,0,70,175,175,77,m
1,good,0,1,1,64,125,115,33,f
2,good,1,1,1,60,105,105,49,f
3,good,1,1,0,66,132,124,42,f
4,very good,0,1,0,61,150,130,55,f

## Numerical data

In [4]:
# Normalisation with MinMaxScaler
minmax_scaler = preprocessing.MinMaxScaler().fit(data[['age']])
data['age'] = minmax_scaler.transform(data[['age']])

In [5]:
# Standardisation with StandardScaler
std_scaler = preprocessing.StandardScaler().fit(data[['height','weight','wtdesire']] )
data[['height','weight','wtdesire']] = std_scaler.transform(data[['height','weight','wtdesire']])

In [6]:
data.head()

,genhlth,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender
0,good,0,1,0,0.682792,0.132661,0.621824,0.728395,m
1,good,0,1,1,-0.771453,-1.114845,-1.252443,0.185185,f
2,good,1,1,1,-1.740950,-1.613847,-1.564821,0.382716,f
3,good,1,1,0,-0.286704,-0.940194,-0.971303,0.296296,f
4,very good,0,1,0,-1.498576,-0.491092,-0.783876,0.456790,f

In [7]:
data.describe()

,exerany,hlthplan,smoke100,height,weight,wtdesire,age
count,20000.000000,20000.000000,20000.000000,2.000000e+04,2.000000e+04,2.000000e+04,20000.000000
mean,0.745700,0.873800,0.472050,-9.188983e-16,-9.516493e-17,6.755707e-18,0.334176
std,0.435478,0.332083,0.499231,1.000025e+00,1.000025e+00,1.000025e+00,0.212255
min,0.000000,0.000000,0.000000,-4.649441e+00,-2.537002e+00,-2.720620e+00,0.000000
25%,0.000000,1.000000,0.000000,-7.714529e-01,-7.405932e-01,-7.838765e-01,0.160494
50%,1.000000,1.000000,0.000000,-4.433025e-02,-1.168402e-01,-1.591206e-01,0.308642
75%,1.000000,1.000000,1.000000,6.827924e-01,5.069128e-01,6.218242e-01,0.481481
max,1.000000,1.000000,1.000000,6.257400e+00,8.241450e+00,1.639691e+01,1.000000

## Categorical data

### One hot encoding

In [8]:
data_onehot = pd.get_dummies(data, columns=['genhlth'], drop_first=False)
data_onehot.head()

,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender,genhlth_excellent,genhlth_fair,genhlth_good,genhlth_poor,genhlth_very good
0,0,1,0,0.682792,0.132661,0.621824,0.728395,m,0,0,1,0,0
1,0,1,1,-0.771453,-1.114845,-1.252443,0.185185,f,0,0,1,0,0
2,1,1,1,-1.740950,-1.613847,-1.564821,0.382716,f,0,0,1,0,0
3,1,1,0,-0.286704,-0.940194,-0.971303,0.296296,f,0,0,1,0,0
4,0,1,0,-1.498576,-0.491092,-0.783876,0.456790,f,0,0,0,0,1

In [9]:
# Using scikit-learn OneHotEncoder
data = pd.read_csv('cdc.csv')

encoder = preprocessing.OneHotEncoder(sparse=False)
genhlth_encoded = encoder.fit_transform(data[['genhlth']])
genhlth_df = pd.DataFrame(genhlth_encoded)

# Concatenate the encoded columns with the original data
data = pd.concat([data, genhlth_df], axis=1)

# Drop the original categorical column
data = data.drop('genhlth', axis=1)

data.head()

,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender,0,1,2,3,4
0,0,1,0,70,175,175,77,m,0.0,0.0,1.0,0.0,0.0
1,0,1,1,64,125,115,33,f,0.0,0.0,1.0,0.0,0.0
2,1,1,1,60,105,105,49,f,0.0,0.0,1.0,0.0,0.0
3,1,1,0,66,132,124,42,f,0.0,0.0,1.0,0.0,0.0
4,0,1,0,61,150,130,55,f,0.0,0.0,0.0,0.0,1.0

### Dummy encoding

In [11]:
data = pd.read_csv('cdc.csv')

data_dummy = pd.get_dummies(data, columns=['genhlth'], drop_first=True)
data_dummy.head()

,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender,genhlth_fair,genhlth_good,genhlth_poor,genhlth_very good
0,0,1,0,70,175,175,77,m,0,1,0,0
1,0,1,1,64,125,115,33,f,0,1,0,0
2,1,1,1,60,105,105,49,f,0,1,0,0
3,1,1,0,66,132,124,42,f,0,1,0,0
4,0,1,0,61,150,130,55,f,0,0,0,1

In [12]:
# Using scikit-learn OneHotEncoder
data = pd.read_csv('cdc.csv')

encoder = preprocessing.OneHotEncoder(sparse=False,drop='first')
genhlth_encoded = encoder.fit_transform(data[['genhlth']])
genhlth_df = pd.DataFrame(genhlth_encoded)

# Concatenate the encoded columns with the original data
data = pd.concat([data, genhlth_df], axis=1)

# Drop the original categorical column
data = data.drop('genhlth', axis=1)

data.head()

,exerany,hlthplan,smoke100,height,weight,wtdesire,age,gender,0,1,2,3
0,0,1,0,70,175,175,77,m,0.0,1.0,0.0,0.0
1,0,1,1,64,125,115,33,f,0.0,1.0,0.0,0.0
2,1,1,1,60,105,105,49,f,0.0,1.0,0.0,0.0
3,1,1,0,66,132,124,42,f,0.0,1.0,0.0,0.0
4,0,1,0,61,150,130,55,f,0.0,0.0,0.0,1.0

## Grouping and aggregation

In [13]:
# read data
data = pd.read_csv('gapminder.csv')
data.head()

,country,year,region,population,life_expectancy,age5_surviving,babies_per_woman,gdp_per_capita,gdp_per_day
0,Afghanistan,1800,Asia,3280000.0,28.21,53.142,7.0,603.0,1.650924
1,Afghanistan,1810,Asia,3280000.0,28.11,53.002,7.0,604.0,1.653662
2,Afghanistan,1820,Asia,3323519.0,28.01,52.862,7.0,604.0,1.653662
3,Afghanistan,1830,Asia,3448982.0,27.90,52.719,7.0,625.0,1.711157
4,Afghanistan,1840,Asia,3625022.0,27.80,52.576,7.0,647.0,1.771389

In [14]:
# calculate the mean life expectancy by region
data.groupby('region')['life_expectancy'].mean()

region
Africa     48.173829
America    60.397871
Asia       55.761026
Europe     66.017678
Name: life_expectancy, dtype: float64

In [15]:
# multiple aggregations
data.groupby('region')['life_expectancy'].agg(['min','mean','max'])

           min       mean   max
region
Africa    4.00  48.173829  77.6
America  24.56  60.397871  81.7
Asia      8.00  55.761026  83.2
Europe   19.76  66.017678  83.3

In [16]:
data.groupby(['region','year'])['life_expectancy'].agg(['min','mean','max'])

              min       mean   max
region year
Africa 1800  25.1  30.596226  37.0
       1810  25.1  30.598113  37.0
       1820   6.5  30.179434  37.0
       1830  25.1  30.621132  37.0
       1840  25.1  30.676226  37.0
...           ...        ...   ...
Europe 2011  70.3  77.935714  82.9
       2012  70.4  78.180952  83.1
       2013  70.6  78.411905  83.2
       2014  70.7  78.569048  83.3
       2015  71.0  78.707143  83.3

[324 rows x 3 columns]

### Concatenation

In [17]:
s1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
s2 = pd.Series(['X', 'Y', 'Z'], index=[4, 5, 6])
pd.concat([s1, s2])

1    A
2    B
3    C
4    X
5    Y
6    Z
dtype: object

In [18]:
exam_data_G1 = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily'],
'score': [12.5, 9, 16.5, 8, 9],
'attempts': [1, 3, 2, 3, 2],
'qualify': ['yes', 'no', 'yes', 'no', 'no']}

exam_data_G2 = {'name': ['Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'score': [20, 14.5, 8, 8, 19],
'attempts': [3, 1, 1, 2, 1],
'qualify': ['yes', 'yes', 'no', 'no', 'yes']}

In [19]:
G1 = pd.DataFrame(exam_data_G1)
G2 = pd.DataFrame(exam_data_G2)

In [20]:
G = pd.concat([G1,G2],axis=0)
G

        name  score  attempts qualify
0       Anne   12.5         1     yes
1      David    9.0         3      no
2  Katherine   16.5         2     yes
3      James    8.0         3      no
4      Emily    9.0         2      no
0    Michael   20.0         3     yes
1    Matthew   14.5         1     yes
2      Laura    8.0         1      no
3      Kevin    8.0         2      no
4       John   19.0         1     yes

Concatenating horizontally: axis = 1

### Append

In [21]:
G = G1.append(G2)
G

        name  score  attempts qualify
0       Anne   12.5         1     yes
1      David    9.0         3      no
2  Katherine   16.5         2     yes
3      James    8.0         3      no
4      Emily    9.0         2      no
0    Michael   20.0         3     yes
1    Matthew   14.5         1     yes
2      Laura    8.0         1      no
3      Kevin    8.0         2      no
4       John   19.0         1     yes

#### Notice the duplicated indices. This happens because Pandas concatenation preserves indices.

In [22]:
# Dealing with duplicated indices - catching the repeats as error
try:
    pd.concat([G1,G2], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [23]:
# Dealing with duplicated indices - ignoring the existing index
G = pd.concat([G1,G2], ignore_index=True)
G

        name  score  attempts qualify
0       Anne   12.5         1     yes
1      David    9.0         3      no
2  Katherine   16.5         2     yes
3      James    8.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    8.0         1      no
8      Kevin    8.0         2      no
9       John   19.0         1     yes

### Merge and join

#### one-to-one joins

In [24]:
exam_data_scores = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'score': [12.5, 9, 16.5, 8, 9,20, 14.5, 8, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]}

exam_data_qual = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [25]:
scores = pd.DataFrame(exam_data_scores)
qual = pd.DataFrame(exam_data_qual)

In [26]:
exams = pd.merge(scores,qual)
exams

        name  score  attempts qualify
0       Anne   12.5         1     yes
1      David    9.0         3      no
2  Katherine   16.5         2     yes
3      James    8.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    8.0         1      no
8      Kevin    8.0         2      no
9       John   19.0         1     yes

Each of the merged data frame has a column 'name' which is authomatically assumed to be the key.
Note that the existing indices are discarded.

#### many-to-one joins

In [27]:
next_course = {'qualify': ['yes', 'no'],
'next course': ['advanced', 'resit']}
next_course = pd.DataFrame(next_course)

In [28]:
future = pd.merge(exams,next_course)
future

        name  score  attempts qualify next course
0       Anne   12.5         1     yes    advanced
1  Katherine   16.5         2     yes    advanced
2    Michael   20.0         3     yes    advanced
3    Matthew   14.5         1     yes    advanced
4       John   19.0         1     yes    advanced
5      David    9.0         3      no       resit
6      James    8.0         3      no       resit
7      Emily    9.0         2      no       resit
8      Laura    8.0         1      no       resit
9      Kevin    8.0         2      no       resit

#### many-to-many joins

In [29]:
student_course = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'course': ['analytics', 'programming', 'project management', 'analytics', 'project management', 'programming', 'programming', 'project management', 'analytics', 'analytics']}
student_course = pd.DataFrame(student_course)

course_skills = {'course': ['analytics','analytics','analytics','analytics','programming','programming','programming','project management','project management','project management'],
                 'skills': ['mathematics', 'statistics', 'Python', 'Excel','Python', 'R', 'Java','waterfall', 'agile', 'Excel']}
course_skills = pd.DataFrame(course_skills)

In [30]:
SCS = pd.merge(student_course,course_skills)
SCS

         name              course       skills
0        Anne           analytics  mathematics
1        Anne           analytics   statistics
2        Anne           analytics       Python
3        Anne           analytics        Excel
4       James           analytics  mathematics
5       James           analytics   statistics
6       James           analytics       Python
7       James           analytics        Excel
8       Kevin           analytics  mathematics
9       Kevin           analytics   statistics
10      Kevin           analytics       Python
11      Kevin           analytics        Excel
12       John           analytics  mathematics
13       John           analytics   statistics
14       John           analytics       Python
15       John           analytics        Excel
16      David         programming       Python
17      David         programming            R
18      David         programming         Java
19    Michael         programming       Python
20    Michael         programming            R
21    Michael         programming         Java
22    Matthew         programming       Python
23    Matthew         programming            R
24    Matthew         programming         Java
25  Katherine  project management    waterfall
26  Katherine  project management        agile
27  Katherine  project management        Excel
28      Emily  project management    waterfall
29      Emily  project management        agile
30      Emily  project management        Excel
31      Laura  project management    waterfall
32      Laura  project management        agile
33      Laura  project management        Excel

#### Specifying the merge key

In [31]:
SCS = pd.merge(student_course,course_skills,on='course')
SCS

         name              course       skills
0        Anne           analytics  mathematics
1        Anne           analytics   statistics
2        Anne           analytics       Python
3        Anne           analytics        Excel
4       James           analytics  mathematics
5       James           analytics   statistics
6       James           analytics       Python
7       James           analytics        Excel
8       Kevin           analytics  mathematics
9       Kevin           analytics   statistics
10      Kevin           analytics       Python
11      Kevin           analytics        Excel
12       John           analytics  mathematics
13       John           analytics   statistics
14       John           analytics       Python
15       John           analytics        Excel
16      David         programming       Python
17      David         programming            R
18      David         programming         Java
19    Michael         programming       Python
20    Michael         programming            R
21    Michael         programming         Java
22    Matthew         programming       Python
23    Matthew         programming            R
24    Matthew         programming         Java
25  Katherine  project management    waterfall
26  Katherine  project management        agile
27  Katherine  project management        Excel
28      Emily  project management    waterfall
29      Emily  project management        agile
30      Emily  project management        Excel
31      Laura  project management    waterfall
32      Laura  project management        agile
33      Laura  project management        Excel

In [32]:
student_course = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'enrolled': ['analytics', 'programming', 'project management', 'analytics', 'project management', 'programming', 'programming', 'project management', 'analytics', 'analytics']}
student_course = pd.DataFrame(student_course)

course_skills = {'course': ['analytics','analytics','analytics','analytics','programming','programming','programming','project management','project management','project management'],
                 'skills': ['mathematics', 'statistics', 'Python', 'Excel','Python', 'R', 'Java','waterfall', 'agile', 'Excel']}
course_skills = pd.DataFrame(course_skills)

In [33]:
SCS = pd.merge(student_course,course_skills,left_on='enrolled',right_on='course')
SCS

         name            enrolled              course       skills
0        Anne           analytics           analytics  mathematics
1        Anne           analytics           analytics   statistics
2        Anne           analytics           analytics       Python
3        Anne           analytics           analytics        Excel
4       James           analytics           analytics  mathematics
5       James           analytics           analytics   statistics
6       James           analytics           analytics       Python
7       James           analytics           analytics        Excel
8       Kevin           analytics           analytics  mathematics
9       Kevin           analytics           analytics   statistics
10      Kevin           analytics           analytics       Python
11      Kevin           analytics           analytics        Excel
12       John           analytics           analytics  mathematics
13       John           analytics           analytics   statistics
14       John           analytics           analytics       Python
15       John           analytics           analytics        Excel
16      David         programming         programming       Python
17      David         programming         programming            R
18      David         programming         programming         Java
19    Michael         programming         programming       Python
20    Michael         programming         programming            R
21    Michael         programming         programming         Java
22    Matthew         programming         programming       Python
23    Matthew         programming         programming            R
24    Matthew         programming         programming         Java
25  Katherine  project management  project management    waterfall
26  Katherine  project management  project management        agile
27  Katherine  project management  project management        Excel
28      Emily  project management  project management    waterfall
29      Emily  project management  project management        agile
30      Emily  project management  project management        Excel
31      Laura  project management  project management    waterfall
32      Laura  project management  project management        agile
33      Laura  project management  project management        Excel

The result has a redundant column that we can drop.

In [34]:
SCS = pd.merge(student_course,course_skills,left_on='enrolled',right_on='course').drop('enrolled',axis=1)
SCS

         name              course       skills
0        Anne           analytics  mathematics
1        Anne           analytics   statistics
2        Anne           analytics       Python
3        Anne           analytics        Excel
4       James           analytics  mathematics
5       James           analytics   statistics
6       James           analytics       Python
7       James           analytics        Excel
8       Kevin           analytics  mathematics
9       Kevin           analytics   statistics
10      Kevin           analytics       Python
11      Kevin           analytics        Excel
12       John           analytics  mathematics
13       John           analytics   statistics
14       John           analytics       Python
15       John           analytics        Excel
16      David         programming       Python
17      David         programming            R
18      David         programming         Java
19    Michael         programming       Python
20    Michael         programming            R
21    Michael         programming         Java
22    Matthew         programming       Python
23    Matthew         programming            R
24    Matthew         programming         Java
25  Katherine  project management    waterfall
26  Katherine  project management        agile
27  Katherine  project management        Excel
28      Emily  project management    waterfall
29      Emily  project management        agile
30      Emily  project management        Excel
31      Laura  project management    waterfall
32      Laura  project management        agile
33      Laura  project management        Excel

### Joins

In [35]:
clients = pd.read_csv('clients.csv')
clients

   client_id   name
0          1  Alice
1          2    Bob
2          3  Chris
3          4  Donna

In [36]:
orders = pd.read_csv('orders.csv')
orders

   order_id  client_id  value
0         1          1     10
1         2          2     20
2         3          2     30
3         4          3     40
4         5          5     50

#### Inner join (default)

In [37]:
clients_orders = pd.merge(clients,orders)
clients_orders

   client_id   name  order_id  value
0          1  Alice         1     10
1          2    Bob         2     20
2          2    Bob         3     30
3          3  Chris         4     40

In [38]:
clients_orders = pd.merge(clients,orders,how='inner')
clients_orders

   client_id   name  order_id  value
0          1  Alice         1     10
1          2    Bob         2     20
2          2    Bob         3     30
3          3  Chris         4     40

#### Left join

In [39]:
clients_orders = pd.merge(clients,orders,how='left')
clients_orders

   client_id   name  order_id  value
0          1  Alice       1.0   10.0
1          2    Bob       2.0   20.0
2          2    Bob       3.0   30.0
3          3  Chris       4.0   40.0
4          4  Donna       NaN    NaN

#### Right join

In [40]:
clients_orders = pd.merge(clients,orders,how='right')
clients_orders

   client_id   name  order_id  value
0          1  Alice         1     10
1          2    Bob         2     20
2          2    Bob         3     30
3          3  Chris         4     40
4          5    NaN         5     50

#### Outer join

In [41]:
clients_orders = pd.merge(clients,orders,how='outer')
clients_orders

   client_id   name  order_id  value
0          1  Alice       1.0   10.0
1          2    Bob       2.0   20.0
2          2    Bob       3.0   30.0
3          3  Chris       4.0   40.0
4          4  Donna       NaN    NaN
5          5    NaN       5.0   50.0

### Using SQL on pandas data frames

In [42]:
import pandasql as pds

In [43]:
# Read the data
data = pd.read_csv('gapminder.csv')
data.head()

,country,year,region,population,life_expectancy,age5_surviving,babies_per_woman,gdp_per_capita,gdp_per_day
0,Afghanistan,1800,Asia,3280000.0,28.21,53.142,7.0,603.0,1.650924
1,Afghanistan,1810,Asia,3280000.0,28.11,53.002,7.0,604.0,1.653662
2,Afghanistan,1820,Asia,3323519.0,28.01,52.862,7.0,604.0,1.653662
3,Afghanistan,1830,Asia,3448982.0,27.90,52.719,7.0,625.0,1.711157
4,Afghanistan,1840,Asia,3625022.0,27.80,52.576,7.0,647.0,1.771389

In [44]:
# Treat data frames as tables and use SQL as usual!
x = pds.sqldf('SELECT COUNT(*) AS no_of_records FROM data')
x

   no_of_records
0          14580

In [45]:
x = pds.sqldf('SELECT year, country, region, gdp_per_day FROM data WHERE country LIKE "%mon%" AND year>2013 ORDER BY year, country')
x

   year          country  region  gdp_per_day
0  2014         Mongolia    Asia    31.509925
1  2014       Montenegro  Europe    39.310062
2  2014  Solomon Islands    Asia     5.557837
3  2015         Mongolia    Asia    32.358658
4  2015       Montenegro  Europe    40.610541
5  2015  Solomon Islands    Asia     5.604381

In [46]:
x = pds.sqldf('SELECT region, COUNT(*) AS no_of_countries, SUM(population) AS total_population, AVG(gdp_per_day) avg_gdp_per_day FROM data WHERE year=2015 GROUP BY region ORDER BY avg_gdp_per_day DESC')
x

    region  no_of_countries  total_population  avg_gdp_per_day
0   Europe               42      6.868373e+08        81.163456
1     Asia               52      4.299142e+09        55.770968
2  America               33      9.865771e+08        42.282538
3   Africa               53      1.172161e+09        15.344156